Revit 2024 API
Entity Constructor
 The default-constructed Entity is invalid.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public Entity()
Visual Basic
Public Sub New
Visual C++
public:
Entity()
Remarks
 Invalid entities may be used as token values. E.g., setting an invalid subentity is equivalent to deleting the stored one.
See Also
Entity Class
Entity Overload
Autodesk.Revit.DB.ExtensibleStorage Namespace